In [14]:
import pandas as pd

In [16]:
df=pd.DataFrame({'Roll no' : [1,2,3,4,5],
                'Age' : [19,23,65,24,30],
                'Name' : "sabiha habiba alfiya tuba kaynat" .split()
                })

In [17]:
df

   Roll no  Age    Name
0        1   19  sabiha
1        2   23  habiba
2        3   65  alfiya
3        4   24    tuba
4        5   30  kaynat

In [18]:
df['firstletter'] = df['Name'].str[0]

In [19]:
df

   Roll no  Age    Name firstletter
0        1   19  sabiha           s
1        2   23  habiba           h
2        3   65  alfiya           a
3        4   24    tuba           t
4        5   30  kaynat           k

In [20]:
df['double'] = df['Age']**2

In [21]:
df

   Roll no  Age    Name firstletter  double
0        1   19  sabiha           s     361
1        2   23  habiba           h     529
2        3   65  alfiya           a    4225
3        4   24    tuba           t     576
4        5   30  kaynat           k     900